Repository: ntoporcov/openclient
Catalog: OpenCodeIOSClient/Localizable.xcstrings
Source language: en
Languages: it, pt_br

source: Cyan
it: Ciano
pt_br: Ciano

source: d
it: g

source: Daily
it: Giornaliero
pt_br: Diário

source: Daily Prompt Limit Reached
it: Limite giornaliero di prompt raggiunto
pt_br: Limite diário de prompts atingido

source: Darker tiles mean more changed lines. Tap a tile to open that file diff.
it: I riquadri più scuri indicano più righe modificate. Tocca un riquadro per aprire il diff di quel file.
pt_br: Blocos mais escuros indicam mais linhas alteradas. Toque em um bloco para abrir o diff do arquivo.

source: Debug Entitlement
it: Entitlement di debug
pt_br: Entitlement de depuração

source: Debug JSON
it: JSON di debug
pt_br: JSON de depuração

source: Debug Probe
it: Sonda di debug
pt_br: Sonda de depuração

source: Default
it: Predefinito
pt_br: Padrão

source: Delete
it: Elimina
pt_br: Excluir

source: Delete Worktree
it: Elimina worktree
pt_br: Excluir worktree

source: Deleted
it: Eliminato
pt_br: Excluído

source: Deleting
it: Eliminazione in corso
pt_br: Excluindo

source: Destination Parent Directory
it: Cartella padre di destinazione
pt_br: Diretório pai de destino

source: Details
it: Dettagli
pt_br: Detalhes

source: Device tools are available through port %lld.
it: Gli strumenti del dispositivo sono disponibili tramite la porta %lld.
pt_br: As ferramentas do dispositivo estão disponíveis através da porta %lld.

source: Diagnostic
it: Diagnostica
pt_br: Diagnóstico

source: Diagnostic: %@
it: Diagnostica: %@
pt_br: Diagnóstico: %@

source: Dictate
it: Detta
pt_br: Ditar

source: Dictation is not available right now.
it: La dettatura non è disponibile al momento.
pt_br: O ditado não está disponível no momento.

source: Dictation Unavailable
it: Dettatura non disponibile
pt_br: Ditado indisponível

source: Diff Unavailable
it: Diff non disponibile
pt_br: Diff indisponível

source: Directories
it: Cartelle
pt_br: Diretórios

source: Directory
it: Cartella
pt_br: Diretório

source: Disable Auto-Start
it: Disattiva avvio automatico
pt_br: Desativar início automático

source: Disabled
it: Disattivato
pt_br: Desabilitado

source: Discard Changes and Remove
it: Scarta modifiche e rimuovi
pt_br: Descartar alterações e remover

source: Discard Changes and Remove Workspace?
it: Scartare le modifiche e rimuovere lo spazio di lavoro?
pt_br: Descartar alterações e remover espaço de trabalho?

source: Discombobulating
it: Disorientando
pt_br: Desconcertante

source: Disconnect
it: Disconnetti
pt_br: Desconectar

source: Disconnect moved
it: Disconnetti si è spostato
pt_br: Desconectar mudou de lugar

source: Disconnect now sits at the bottom of the Projects list, keeping the main navigation focused.
it: Disconnetti ora si trova in fondo all'elenco Progetti, così la navigazione principale resta più essenziale.
pt_br: Desconectar agora fica na parte inferior da lista de Projetos, mantendo a navegação principal mais focada.

source: Disconnected
it: Disconnesso
pt_br: Desconectado

source: Dismiss
it: Ignora
pt_br: Dispensar

source: Dismiss browser instruction
it: Ignora istruzione browser
pt_br: Ignorar instruções do navegador

source: Dismiss Keyboard
it: Chiudi tastiera
pt_br: Dispensar teclado

source: Dismiss Search
it: Chiudi ricerca
pt_br: Dispensar pesquisa

source: Display
it: Visualizzazione
pt_br: Exibição

source: Display Name
it: Nome visualizzato
pt_br: Nome de exibição

source: Display Style
it: Stile di visualizzazione
pt_br: Estilo de exibição

source: Displayed Usage
it: Utilizzo visualizzato
pt_br: Uso exibido

source: Done
it: Fatto
pt_br: Feito

source: Donut chart
it: Grafico a ciambella
pt_br: Gráfico de rosca

source: Download more voices in Settings > Accessibility > Read & Speak (or Spoken Content) > Voices. OpenClient updates this list automatically after a voice downloads.
it: Scarica altre voci in Impostazioni > Accessibilità > Leggi e parla (o Contenuto letto ad alta voce) > Voci. OpenClient aggiorna automaticamente questo elenco dopo il download di una voce.
pt_br: Baixe mais vozes em Ajustes > Acessibilidade > Ler e Falar (ou Conteúdo Falado) > Vozes. O OpenClient atualiza esta lista automaticamente após o download de uma voz.

source: Downloaded chat is read-only while the server is unavailable
it: La chat scaricata è di sola lettura finché il server non è disponibile
pt_br: O chat baixado é somente leitura enquanto o servidor está indisponível

source: Drag metrics into one shared order. Home and Activity visibility can be chosen independently.
it: Trascina le metriche in un unico ordine condiviso. La visibilità in Home e Attività può essere scelta separatamente.
pt_br: Arraste as métricas para uma única ordem compartilhada. A visibilidade em Início e Atividade pode ser escolhida separadamente.

source: Draw a diagram
it: Disegna un diagramma
pt_br: Desenhe um diagrama

source: Draw something before attaching.
it: Disegna qualcosa prima di allegare.
pt_br: Desenhe algo antes de anexar.

source: Drawing Error
it: Errore di disegno
pt_br: Erro de desenho

source: Drops
it: Drop
pt_br: Descartes

source: Each custom header needs a key and value.
it: Ogni intestazione personalizzata richiede una chiave e un valore.
pt_br: Cada cabeçalho personalizado precisa de uma chave e um valor.

source: Each custom model needs an ID and name.
it: Ogni modello personalizzato richiede un ID e un nome.
pt_br: Cada modelo personalizado precisa de um ID e um nome.

source: Edit
it: Modifica
pt_br: Editar

source: Edit Server
it: Modifica server
pt_br: Editar servidor

source: Enable Auto-Start
it: Attiva avvio automatico
pt_br: Ativar início automático

source: Enable Microphone access for OpenClient in Settings to dictate messages.
it: Attiva l'accesso al microfono per OpenClient nelle Impostazioni per dettare i messaggi.
pt_br: Ative o acesso ao microfone para o OpenClient em Ajustes para ditar mensagens.

source: Enable Speech Recognition for OpenClient in Settings to dictate messages.
it: Attiva il riconoscimento vocale per OpenClient nelle Impostazioni per dettare i messaggi.
pt_br: Ative o Reconhecimento de Fala para o OpenClient em Ajustes para ditar mensagens.

source: Enabled
it: Attivato
pt_br: Habilitado

source: Enhanced
it: Migliorata
pt_br: Aprimorada

source: Enter a message before running this shortcut.
it: Inserisci un messaggio prima di eseguire questo comando rapido.
pt_br: Digite uma mensagem antes de executar este atalho.

source: Enter a new title for this session.
it: Inserisci un nuovo titolo per questa sessione.
pt_br: Insira um novo título para esta sessão.

source: Enter Full Screen
it: Attiva schermo intero
pt_br: Entrar em tela cheia

source: Entering text
it: Inserimento testo
pt_br: Inserindo texto

source: Environment
it: Ambiente
pt_br: Ambiente

source: Error
it: Errore
pt_br: Erro

source: Error Code
it: Codice errore
pt_br: Código de erro

source: Error Code: %@
it: Codice errore: %@
pt_br: Código de erro: %@

source: Error Domain
it: Dominio errore
pt_br: Domínio de erro

source: Error Domain: %@
it: Dominio errore: %@
pt_br: Domínio de erro: %@

source: Estimated Input Breakdown
it: Ripartizione stimata dell'input
pt_br: Detalhamento estimado da entrada

source: Every conversation, in motion
it: Ogni conversazione, in movimento
pt_br: Cada conversa, em movimento

source: Every great web journey begins with a single tap.
it: Ogni grande viaggio nel web inizia con un solo tocco.
pt_br: Toda grande jornada pela web começa com um único toque.

source: Everything is ready for your next message.
it: Tutto è pronto per il tuo prossimo messaggio.
pt_br: Tudo está pronto para sua próxima mensagem.

source: Example
it: Esempio
pt_br: Exemplo

source: Example provider usage levels
it: Livelli di utilizzo dei provider di esempio
pt_br: Níveis de uso dos provedores de exemplo

source: Excalidraw is still loading. Try again in a moment.
it: Excalidraw si sta ancora caricando. Riprova tra un momento.
pt_br: Excalidraw ainda está carregando. Tente novamente em alguns instantes.

source: Exited
it: Uscito
pt_br: Encerrado

source: Expand browser
it: Espandi browser
pt_br: Expandir navegador

source: Expected a file path, but received a directory.
it: Previsto un percorso file, ma ricevuta una cartella.
pt_br: Era esperado um caminho de arquivo, mas foi recebido um diretório.

source: EXPERIMENTAL PREVIEW
it: ANTEPRIMA SPERIMENTALE
pt_br: PRÉVIA EXPERIMENTAL

source: Expires
it: Scade tra
pt_br: Expira em

source: Explored
it: Esplorato
pt_br: Explorado

source: Exploring
it: Esplorando
pt_br: Explorando

source: Exporting...
it: Esportazione in corso...
pt_br: Exportando...

source: External spend
it: Spesa esterna
pt_br: Gasto externo

source: Failed
it: Non riuscito
pt_br: Falha

source: Failed or Unconfirmed
it: Non riuscita o non confermata
pt_br: Falhou ou não confirmado

source: Featured
it: In evidenza
pt_br: Em destaque

source: Feedback belongs in the open.
it: Il feedback appartiene allo spazio pubblico.
pt_br: O feedback também deve ser aberto.

source: Fetches available models for a saved OpenClient connection.
it: Recupera i modelli disponibili per una connessione OpenClient salvata.
pt_br: Busca modelos disponíveis para uma conexão OpenClient salva.

source: Fetches projects from a saved OpenClient connection.
it: Recupera i progetti da una connessione OpenClient salvata.
pt_br: Busca projetos de uma conexão OpenClient salva.

source: Fetches root sessions for a selected OpenClient project.
it: Recupera le sessioni principali per un progetto OpenClient selezionato.
pt_br: Busca sessões raiz para um projeto OpenClient selecionado.

source: Fetching the original from the OpenCode host
it: Recupero dell'originale dall'host OpenCode
pt_br: Buscando o original do host OpenCode

source: File Intensity
it: Intensità file
pt_br: Intensidade do arquivo

source: File Tree Error
it: Errore nell'albero dei file
pt_br: Erro na árvore de arquivos

source: Files
it: File
pt_br: Arquivos

# Files changed: %lld · Additions: %lld · Deletions: %lld
source: Files changed: %1$lld · Additions: %2$lld · Deletions: %3$lld
it: File modificati: %1$lld · Aggiunte: %2$lld · Eliminazioni: %3$lld
pt_br: Arquivos alterados: %1$lld · Adições: %2$lld · Exclusões: %3$lld

source: Files Mode
it: Modalità file
pt_br: Modo Arquivos

source: Files Unavailable
it: File non disponibili
pt_br: Arquivos indisponíveis

source: Filter Projects
it: Filtra progetti
pt_br: Filtrar Projetos

source: Filter text
it: Testo del filtro
pt_br: Filtrar texto

source: Find the Bug
it: Trova il bug
pt_br: Encontre o Bug

source: Find the Place
it: Trova il posto
pt_br: Encontre o Lugar

source: Find the Place uses WeatherKit for live weather clues when available. Weather data is provided by  Weather. Legal source: https://weatherkit.apple.com/legal-attribution.html
it: Trova il posto usa WeatherKit per indizi meteo in tempo reale quando disponibili. I dati meteo sono forniti da  Weather. Fonte legale: https://weatherkit.apple.com/legal-attribution.html
pt_br: Encontre o Lugar usa WeatherKit para dicas meteorológicas ao vivo, quando disponíveis. Os dados meteorológicos são fornecidos por  Weather. Fonte legal: https://weatherkit.apple.com/legal-attribution.html

source: Finish Editing Projects
it: Termina modifica progetti
pt_br: Concluir a edição de projetos

source: Flibbertigibbeting
it: Ciarlando
pt_br: Tagarelando

source: Force Connect
it: Forza connessione
pt_br: Forçar conexão

source: Forging
it: Forgiando
pt_br: Forjando

source: Fork Session
it: Fork sessione
pt_br: Fazer fork da sessão

source: Form actions are unavailable on this connection.
it: Le azioni dei moduli non sono disponibili con questa connessione.
pt_br: As ações de formulário não estão disponíveis nesta conexão.

source: Found %lld model.
it: Trovato %lld modello.
pt_br: %lld modelo encontrado.

source: Found %lld models.
it: Trovati %lld modelli.
pt_br: %lld modelos encontrados.

source: Found %lld project.
it: Trovato %lld progetto.
pt_br: %lld projeto encontrado.

source: Found %lld projects.
it: Trovati %lld progetti.
pt_br: %lld projetos encontrados.

source: Found %lld session.
it: Trovata %lld sessione.
pt_br: %lld sessão encontrada.

source: Found %lld sessions.
it: Trovate %lld sessioni.
pt_br: %lld sessões encontradas.

source: Free
it: Gratuito
pt_br: Grátis

source: Free plan
it: Piano gratuito
pt_br: Plano grátis

source: Free Plan
it: Piano gratuito
pt_br: Plano gratuito

source: Free users can create one session. Open OpenClient to upgrade for unlimited sessions.
it: Gli utenti gratuiti possono creare una sessione. Apri OpenClient per passare a sessioni illimitate.
pt_br: Usuários do plano gratuito podem criar uma sessão. Abra o OpenClient para fazer upgrade e ter sessões ilimitadas.

source: Free users can create one session. Upgrade for unlimited sessions and prompts.
it: Gli utenti gratuiti possono creare una sessione. Esegui l'upgrade per sessioni e prompt illimitati.
pt_br: Usuários do plano gratuito podem criar uma sessão. Faça upgrade para ter sessões e prompts ilimitados.

source: Fun & Games
it: Divertimento e giochi
pt_br: Diversão e jogos

source: Fun & Games moved
it: Divertimento e giochi si è spostato
pt_br: Diversão e jogos mudou de lugar

source: Fun & Games now lives in Global Settings. It is off by default, and you can turn it on here anytime.
it: Divertimento e giochi ora si trova nelle Impostazioni globali. È disattivato per impostazione predefinita e puoi attivarlo qui quando vuoi.
pt_br: Diversão e jogos agora fica nas Configurações globais. O recurso vem desativado por padrão, e você pode ativá-lo aqui quando quiser.

source: Generate New Code
it: Genera nuovo codice
pt_br: Gerar novo código

source: Generating
it: Generazione in corso
pt_br: Gerando

source: Get Connection
it: Ottieni connessione
pt_br: Obter conexão

source: Get Models
it: Ottieni modelli
pt_br: Obter modelos

source: Get OpenClient Connection
it: Ottieni connessione OpenClient
pt_br: Obter conexão do OpenClient

source: Get OpenClient Models
it: Ottieni modelli OpenClient
pt_br: Obter modelos do OpenClient

source: Get OpenClient Projects
it: Ottieni progetti OpenClient
pt_br: Obter projetos do OpenClient

source: Get OpenClient Sessions
it: Ottieni sessioni OpenClient
pt_br: Obter sessões do OpenClient

source: Get Projects
it: Ottieni progetti
pt_br: Obter projetos

source: Get Sessions
it: Ottieni sessioni
pt_br: Obter sessões

source: Getting Started
it: Per iniziare
pt_br: Primeiros passos

source: Git Unavailable
it: Git non disponibile
pt_br: Git indisponível

source: Give me a moment.
it: Dammi un momento.
pt_br: Só um momento.

source: Global
it: Globale

source: Global Settings
it: Impostazioni globali
pt_br: Configurações globais

source: Go ahead. Make a site decision.
it: Avanti. È il momento di prendere una decisione... sul sito.
pt_br: Pode ir. Está na hora de tomar uma decisão de site.

source: GOOD TO KNOW
it: BUONO A SAPERSI
pt_br: É BOM SABER

source: Good URLs are worth the wait.
it: I buoni URL valgono l'attesa.
pt_br: Boas URLs valem a espera.

source: Group sessions by the main worktree and any OpenCode sandbox worktrees for this project.
it: Raggruppa le sessioni per il worktree principale e per eventuali worktree sandbox di OpenCode per questo progetto.
pt_br: Agrupe as sessões pelo worktree principal e pelos worktrees de sandbox do OpenCode deste projeto.

source: Guess a secret city from live weather clues
it: Indovina una città segreta da indizi meteo in tempo reale
pt_br: Adivinhe uma cidade secreta a partir de pistas meteorológicas ao vivo

source: Hatching
it: Covando
pt_br: Preparando

source: Headers
it: Intestazioni
pt_br: Cabeçalhos

source: Hello, world
it: Ciao, mondo
pt_br: Olá, mundo

source: Hello. This is how I will sound in voice conversations.
it: Ciao. Questa è la voce che userò nelle conversazioni vocali.
pt_br: Olá. É assim que minha voz soará nas conversas por voz.

source: Help
it: Aiuto
pt_br: Ajuda

source: Help & Getting Started
it: Aiuto e primi passi
pt_br: Ajuda e primeiros passos

source: Help me contribute a [YOUR LANGUAGE] translation to OpenClient. Clone https://github.com/ntoporcov/openclient and read AGENTS.md, LOCALIZATION.md, and any instructions relevant to the files you edit. Create a dedicated translation branch. Translate every shipping String Catalog entry from English into [YOUR LANGUAGE] across the main app, App Shortcuts, Info.plist copy, the Live Activity extension, and the Share extension. Add the locale to REQUIRED_LANGUAGES in scripts/lint-localizations.rb and to CFBundleLocalizations for every target in project.yml. Use the existing Brazilian Portuguese and Italian localizations as structural examples. Preserve placeholders, format specifiers, URLs, commands, code, and product names exactly, and review translations in their UI context. Regenerate the Xcode project as documented. Run ruby scripts/lint-localizations.rb and the full localization and build checks, then fix every failure. Commit the changes, push the branch, and open a pull request against main that names the language, summarizes the coverage, and lists the validation performed. Do not overwrite unrelated changes, and ask me before making an ambiguous terminology choice.
it: Aiutami a contribuire con una traduzione di OpenClient in [LA TUA LINGUA]. Clona https://github.com/ntoporcov/openclient e leggi AGENTS.md, LOCALIZATION.md e tutte le istruzioni pertinenti ai file che modifichi. Crea un branch dedicato alla traduzione. Traduci dall'inglese in [LA TUA LINGUA] ogni voce dei cataloghi di stringhe distribuiti per l'app principale, i Comandi Rapidi, i testi di Info.plist, l'estensione Attività in tempo reale e l'estensione Condivisione. Aggiungi la lingua a REQUIRED_LANGUAGES in scripts/lint-localizations.rb e a CFBundleLocalizations per ogni target in project.yml. Usa le localizzazioni esistenti in portoghese brasiliano e italiano come esempi strutturali. Mantieni invariati segnaposto, specificatori di formato, URL, comandi, codice e nomi dei prodotti e verifica le traduzioni nel loro contesto nell'interfaccia. Rigenera il progetto Xcode come indicato nella documentazione. Esegui ruby scripts/lint-localizations.rb e i controlli completi di localizzazione e build, quindi correggi ogni errore. Esegui il commit delle modifiche, pubblica il branch e apri una pull request verso main che indichi la lingua, riepiloghi la copertura ed elenchi le verifiche eseguite. Non sovrascrivere modifiche non correlate e chiedimi conferma prima di scegliere un termine ambiguo.
pt_br: Ajude-me a contribuir com uma tradução do OpenClient para [SEU IDIOMA]. Clone https://github.com/ntoporcov/openclient e leia AGENTS.md, LOCALIZATION.md e todas as instruções relevantes para os arquivos que você editar. Crie uma branch dedicada à tradução. Traduza todas as entradas dos Catálogos de Strings distribuídos, do inglês para [SEU IDIOMA], no app principal, nos Atalhos de App, nos textos do Info.plist, na extensão de Atividade ao Vivo e na extensão de Compartilhamento. Adicione o locale a REQUIRED_LANGUAGES em scripts/lint-localizations.rb e a CFBundleLocalizations para todos os targets em project.yml. Use as localizações existentes em português do Brasil e italiano como exemplos estruturais. Preserve placeholders, especificadores de formato, URLs, comandos, código e nomes de produtos exatamente como estão e revise as traduções no contexto da interface. Gere novamente o projeto Xcode conforme documentado. Execute ruby scripts/lint-localizations.rb e as verificações completas de localização e build e corrija todas as falhas. Faça commit das alterações, envie a branch e abra um pull request para main que informe o idioma, resuma a cobertura e liste as validações realizadas. Não sobrescreva alterações não relacionadas e pergunte antes de escolher um termo ambíguo.

source: Hmm, let me think about that.
it: Mmh, fammi pensare.
pt_br: Hmm, deixe-me pensar sobre isso.

source: Hold
it: Tieni premuto
pt_br: Segurar

source: Hold for more options
it: Tieni premuto per altre opzioni
pt_br: Mantenha pressionado para ver mais opções

source: Hold Sending
it: Sospendi invio
pt_br: Suspender envio

source: Hold to Talk
it: Tieni premuto per parlare
pt_br: Segure para falar

source: Home and Activity visibility can be chosen independently.
it: La visibilità in Home e Attività può essere scelta separatamente.
pt_br: A visibilidade em Início e Atividade pode ser escolhida separadamente.

source: Home Screen widgets
it: Widget per la schermata Home
pt_br: Widgets da Tela de Início

source: Home Screen Widgets
it: Widget della schermata Home
pt_br: Widgets da tela inicial

source: Honking
it: Strombazzando
pt_br: Buzinando

source: How To Connect Remotely
it: Come connettersi da remoto
pt_br: Como se conectar remotamente

source: How to think about the app
it: Come pensare all'app
pt_br: Como pensar sobre o aplicativo

source: I completed this step
it: Ho completato questo passaggio
pt_br: Concluí esta etapa

source: I understand this connection is insecure
it: Capisco che questa connessione non è sicura
pt_br: Entendo que esta conexão é insegura

source: I'm thinking that through.
it: Ci sto riflettendo.
pt_br: Estou pensando nisso.

source: Icon
it: Icona
pt_br: Ícone

source: Idle
it: Inattivo
pt_br: Inativo

source: If authorization uses a localhost callback, complete it on the machine running OpenCode. Leaving this screen stops waiting; the server attempt expires automatically.
it: Se l'autorizzazione usa un callback localhost, completala sulla macchina che esegue OpenCode. Uscendo da questa schermata si interrompe l'attesa; il tentativo sul server scade automaticamente.
pt_br: Se a autorização usar um callback de localhost, conclua-a na máquina que executa o OpenCode. Sair desta tela interrompe a espera; a tentativa no servidor expira automaticamente.

source: If this opens a localhost callback, complete it on the machine running OpenCode. Device-code flows can be completed from this iPhone.
it: Se questo apre un callback su localhost, completalo sulla macchina che esegue OpenCode. I flussi device-code possono essere completati da questo iPhone.
pt_br: Se isso abrir um callback em localhost, conclua o processo na máquina que executa o OpenCode. Fluxos de código do dispositivo podem ser concluídos neste iPhone.

source: If you only need OpenCode while you are at home or on the same office network, keeping the server available only on your LAN is perfectly reasonable. It is simple, low-risk, and often the least fragile option as long as you do not need access while away from that network.
it: Se ti serve OpenCode solo quando sei a casa o sulla stessa rete dell'ufficio, mantenere il server disponibile solo sulla tua LAN è perfettamente ragionevole. È semplice, a basso rischio e spesso l'opzione meno fragile, purché tu non abbia bisogno di accedervi lontano da quella rete.
pt_br: Se você só precisa do OpenCode em casa ou na rede do escritório, é perfeitamente razoável manter o servidor disponível apenas na LAN. É uma opção simples, de baixo risco e geralmente mais confiável, desde que você não precise de acesso fora dessa rede.
